Core/src/Catalogs/ШаблоныЗаполнения/ШаблоныЗаполнения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ШаблоныЗаполнения</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ИмяСхемыКомпоновкиДанных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеНастроекКомпоновкиДанных</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеСхемыКомпоновкиДанных</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОпераций</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеСоответсвияРеквизитов</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>СсылкаИсточника</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыОперацийРасходСоСчета</types>
      <types>EnumRef.ВидыОперацийПоступлениеНаСчет</types>
    </type>
  </attributes>
  <attributes>
    <name>Статья</name>
    <type>
      <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
    </type>
  </attributes>
  <attributes>
    <name>ПризнакАванса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОбменаСИнтернетБанком</name>
    <type>
      <types>EnumRef.ТипыОбменаСИнтернетБанком</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаполнитьДоговор</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Корреспонденция</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидНалога</name>
    <type>
      <types>CatalogRef.ВидыНалогов</types>
    </type>
  </attributes>
  <attributes>
    <name>Действующий</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекСчетПолучатель</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КорреспонденцияРегл</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
</mdclass:Catalog>

Core/src/Enums/ТипыОбменаСИнтернетБанком/ТипыОбменаСИнтернетБанком.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыОбменаСИнтернетБанком</name>
  <enumValues>
    <name>TBC</name>
  </enumValues>
  <enumValues>
    <name>BankOfGeorgia</name>
  </enumValues>
  <enumValues>
    <name>Cartu</name>
  </enumValues>
  <enumValues>
    <name>VTB</name>
  </enumValues>
</mdclass:Enum>

Core/src/Enums/ВидыОперацийПоступлениеНаСчет/ВидыОперацийПоступлениеНаСчет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОперацийПоступлениеНаСчет</name>
  <enumValues>
    <name>ОтПокупателя</name>
  </enumValues>
  <enumValues>
    <name>ОтПоставщика</name>
  </enumValues>
  <enumValues>
    <name>ОтПодотчетника</name>
  </enumValues>
  <enumValues>
    <name>ПокупкаВалюты</name>
  </enumValues>
  <enumValues>
    <name>Прочее</name>
  </enumValues>
  <enumValues>
    <name>ПрочиеРасчеты</name>
  </enumValues>
  <enumValues>
    <name>Налоги</name>
  </enumValues>
  <enumValues>
    <name>РасчетыПоКредитам</name>
  </enumValues>
  <enumValues>
    <name>ВозвратЗаймаСотрудником</name>
  </enumValues>
  <enumValues>
    <name>ПоступлениеОплатыПоКартам</name>
  </enumValues>
  <enumValues>
    <name>ВзносНаличными</name>
  </enumValues>
  <enumValues>
    <name>ПереводСДругогоСчета</name>
  </enumValues>
  <enumValues>
    <name>ОтКурьерскойКомпанииПочты</name>
  </enumValues>
  <enumValues>
    <name>ВозвратДенегОтСотрудника</name>
  </enumValues>
</mdclass:Enum>

Core/src/Enums/ВидыОперацийРасходСоСчета/ВидыОперацийРасходСоСчета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОперацийРасходСоСчета</name>
  <enumValues>
    <name>Поставщику</name>
  </enumValues>
  <enumValues>
    <name>Покупателю</name>
  </enumValues>
  <enumValues>
    <name>Подотчетнику</name>
  </enumValues>
  <enumValues>
    <name>Зарплата</name>
  </enumValues>
  <enumValues>
    <name>Налоги</name>
  </enumValues>
  <enumValues>
    <name>Прочее</name>
  </enumValues>
  <enumValues>
    <name>ПрочиеРасчеты</name>
  </enumValues>
  <enumValues>
    <name>РасчетыПоКредитам</name>
  </enumValues>
  <enumValues>
    <name>ВыдачаЗаймаСотруднику</name>
  </enumValues>
  <enumValues>
    <name>ВозвратОплатыНаПлатежныеКарты</name>
  </enumValues>
  <enumValues>
    <name>НаРасходы</name>
  </enumValues>
  <enumValues>
    <name>СнятиеНаличных</name>
  </enumValues>
  <enumValues>
    <name>ПереводНаДругойСчет</name>
  </enumValues>
  <enumValues>
    <name>ЗарплатаВРазрезеСотрудников</name>
    <comment>// Kuzmich, 23.02.2019,Зарплата по ведомости в разрезе сотрудников</comment>
  </enumValues>
  <enumValues>
    <name>ПенсионномуФонду</name>
  </enumValues>
</mdclass:Enum>

Core/src/Catalogs/ШаблоныЗаполнения/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)    	
	
	ДанныеСтрокиЗагрузка = Неопределено;
	Если  Параметры.Свойство("ШаблоныЗаполнения") Тогда 
		ШаблоныЗаполнения = Параметры.ШаблоныЗаполнения;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ЗаполнитьНастройки(Неопределено,ДанныеСтрокиЗагрузка);
	КонецЕсли;
	
	СписокВыбора = Элементы.СсылкаИсточника.СписокВыбора;
	СписокВыбора.Добавить("ПоступлениеНаСчет",Нстр("ka='ანგარიშზე თანხის მიღება';ru='Поступление На Счет'"));
	СписокВыбора.Добавить("РасходСоСчета",Нстр("ka='დანახარჯი ანგარიშიდან';ru='Расход Со Счета'"));
	СписокВыбора.Добавить("ПеремещениеДС",Нстр("ka='ფულის გადაადგილება';ru='Перемещение денег'"));
	
	Массив = Новый Массив;
	Для Каждого Эл Из НастройкиОтбор.Настройки.ДоступныеПоляВыбора.Элементы Цикл 
		Массив.Добавить(строка(Эл.Поле));		
	КонецЦикла;    
	
	ВидимостьГруппПоСсылкаИсточника();	
	ВидимостьЭлементовПоВидуОперации();	
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНастройки(врХрНКД,ДанныеСтрокиЗагрузка)
	
	BOG = Объект.ТипОбменаСИнтернетБанком = Перечисления.ТипыОбменаСИнтернетБанком.BankOfGeorgia;
	TBC = Объект.ТипОбменаСИнтернетБанком = Перечисления.ТипыОбменаСИнтернетБанком.TBC;
	Cartu = Объект.ТипОбменаСИнтернетБанком = Перечисления.ТипыОбменаСИнтернетБанком.Cartu;
	VTB = Объект.ТипОбменаСИнтернетБанком = Перечисления.ТипыОбменаСИнтернетБанком.VTB;
	
	впОбъект = РеквизитФормыВЗначение("Объект");
	Если BOG Тогда
		СхемаКомпоновкиДанных = впОбъект.ПолучитьМакет("МакетЗагрузкиВыписокСФайла_BOG");
	ИначеЕсли TBC Тогда
		СхемаКомпоновкиДанных = впОбъект.ПолучитьМакет("МакетЗагрузкиВыписокСФайла_TBC");
	ИначеЕсли Cartu Тогда
		СхемаКомпоновкиДанных = впОбъект.ПолучитьМакет("МакетЗагрузкиВыписокСФайла_CARTU");
	ИначеЕсли VTB Тогда
		СхемаКомпоновкиДанных = впОбъект.ПолучитьМакет("МакетЗагрузкиВыписокСФайла_VTB");
	Иначе
		Возврат;
	КонецЕсли;
	
	АдресСхемыКомпоновкиДанных = ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, УникальныйИдентификатор);
	
	Если врХрНКД = Неопределено Тогда 
		ТекВариант = СхемаКомпоновкиДанных.ВариантыНастроек.Найти("Основной");
		врНастройки = ТекВариант.Настройки;
	Иначе 
		врНастройки = врХрНКД;
	КонецЕсли;
	НастройкиОтбор.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемыКомпоновкиДанных));
	НастройкиОтбор.ЗагрузитьНастройки(врНастройки);
	
	Если Не ДанныеСтрокиЗагрузка = Неопределено Тогда 
		Для Каждого Стр Из ДанныеСтрокиЗагрузка Цикл 
			НовыйЭлементОтбора = НастройкиОтбор.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			НовыйЭлементОтбора.ЛевоеЗначение  = Стр.ЛевоеЗначение;
			НовыйЭлементОтбора.Использование  = Стр.Использование;
			НовыйЭлементОтбора.ВидСравнения   = Стр.ВидСравнения;
			НовыйЭлементОтбора.ПравоеЗначение = Стр.ПравоеЗначение;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры  

&НаКлиенте
Процедура СсылкаИсточникаПриИзменении(Элемент)
	
	ВидимостьГруппПоСсылкаИсточника();	
	
	ОчиститьВидОперации();
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьВидОперации()
	
	Если Не Объект.СсылкаИсточника = "ПеремещениеДС" Тогда
		Объект.ВидОперации = Неопределено;
	КонецЕсли;	


КонецПроцедуры // ()



&НаСервере
Процедура ВидимостьГруппПоСсылкаИсточника()
	
	ВидимостьГруппаЗначенияДокументаДС		     = Объект.СсылкаИсточника = "ПеремещениеДС";
	Элементы.ГруппаЗначенияДокумента.Видимость   = Не ВидимостьГруппаЗначенияДокументаДС;
	Элементы.ГруппаЗначенияДокументаДС.Видимость = ВидимостьГруппаЗначенияДокументаДС;
	
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидОперации()
	
	Если Объект.СсылкаИсточника = "ПоступлениеНаСчет" Тогда
		Объект.ВидОперации = Перечисления.ВидыОперацийПоступлениеНаСчет.ПустаяСсылка();
	ИначеЕсли Объект.СсылкаИсточника = "РасходСоСчета" Тогда
		Объект.ВидОперации = Перечисления.ВидыОперацийРасходСоСчета.ПустаяСсылка();
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура СсылкаИсточникаПриИзмененииНаСервере()

	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	РС_ОбщегоНазначенияКлиент.ПроверкаМодифицированостиВопрос(Объект.Ссылка, Модифицированность, Отказ);//Паганини	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Если  Параметры.Свойство("ДанныеСтрокиЗагрузка") Тогда 
		ДанныеСтрокиЗагрузка = Параметры.ДанныеСтрокиЗагрузка;
	КонецЕсли;
	СсылкаИсточника = Объект.СсылкаИсточника; 
	врХрНКД     = ТекущийОбъект.ХранилищеНастроекКомпоновкиДанных.получить();
	ЗаполнитьНастройки(врХрНКД,ДанныеСтрокиЗагрузка);
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	test =1;
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ДвоичныеДанныеНастройкиОтбор = Новый ХранилищеЗначения(НастройкиОтбор.ПолучитьНастройки(),Новый СжатиеДанных(9));
	ТекущийОбъект.ХранилищеНастроекКомпоновкиДанных = ДвоичныеДанныеНастройкиОтбор;
	
КонецПроцедуры

&НаКлиенте
Процедура ТипОбменаСИнтернетБанкомПриИзменении(Элемент)
	ТипОбменаСИнтернетБанкомПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ТипОбменаСИнтернетБанкомПриИзмененииНаСервере()
	
	ЗаполнитьНастройки(Неопределено,Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	ВидОперацииПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВидОперацииПриИзмененииНаСервере()
	ВидимостьЭлементовПоВидуОперации();
КонецПроцедуры

&НаСервере
Процедура ВидимостьЭлементовПоВидуОперации()
	
	  ВидимостьДоговора = Объект.ВидОперации = Перечисления.ВидыОперацийПоступлениеНаСчет.ОтПокупателя 
	  ИЛИ Объект.ВидОперации = Перечисления.ВидыОперацийПоступлениеНаСчет.ОтПоставщика
	  ИЛИ Объект.ВидОперации = Перечисления.ВидыОперацийРасходСоСчета.Покупателю
	  ИЛИ Объект.ВидОперации = Перечисления.ВидыОперацийРасходСоСчета.Поставщику;
	  
	  ВидимостьВидНалога =  Объект.ВидОперации = Перечисления.ВидыОперацийПоступлениеНаСчет.Налоги
	  ИЛИ Объект.ВидОперации = Перечисления.ВидыОперацийРасходСоСчета.Налоги;
	  
	  ВидимостьКорреспонденция =  Объект.ВидОперации = Перечисления.ВидыОперацийПоступлениеНаСчет.Прочее
	  ИЛИ Объект.ВидОперации = Перечисления.ВидыОперацийРасходСоСчета.Прочее;
	  
	  Элементы.ЗаполнитьДоговор.Видимость = ВидимостьДоговора;
	  Элементы.ВидНалога.Видимость 		  = ВидимостьВидНалога;
	  Элементы.Корреспонденция.Видимость  = ВидимостьКорреспонденция;
	  Элементы.КорреспонденцияРегл.Видимость  = ВидимостьКорреспонденция;//Паганини

КонецПроцедуры 

&НаКлиенте
Процедура СкопироватьВСписок(Команда)
	
	СписокЗнч = ПолучитьСписокИзТеста();
	Если СписокЗнч.Количество() Тогда 
		
		ТекущиеДанные = Элементы.НастройкиОтбор.ТекущиеДанные;
		
		ЭлементыОтбора = НастройкиОтбор.Настройки.Отбор.Элементы;
		Для Каждого стр Из ЭлементыОтбора Цикл 
			Если стр.ЛевоеЗначение = ТекущиеДанные.ЛевоеЗначение Тогда 
				стр.ПравоеЗначение = СписокЗнч;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Функция  ПолучитьСписокИзТеста()
	
	Текст = "";
	Подсказка = "Введите текст напоминания";
	СписокЗнч = Новый СписокЗначений;
	
	Если ВвестиСтроку(Текст, Подсказка, 0, Истина) Тогда
		Пока  Найти(Текст, Символы.ПС)  > 0 Цикл 
			ДлинаТекст = СтрДлина(Текст);
			НомерСтр = Найти(Текст, Символы.ПС);
			врТекст = СокрЛП(Лев(Текст,НомерСтр));
			СписокЗнч.Добавить(врТекст);
			Текст = Прав(Текст,ДлинаТекст-НомерСтр);
		КонецЦикла;
		
		Если Не Текст ="" Тогда 
			СписокЗнч.Добавить(Текст);
		КонецЕсли;
		
	КонецЕсли;
	Возврат СписокЗнч; 
	
КонецФункции

&НаКлиенте
Процедура ВидОперацииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если НЕ Объект.СсылкаИсточника = "ПеремещениеДС"  Тогда
		СтандартнаяОбработка = Ложь;
		
		ВидыПДР = ПолучитьСписокВидыОпераций();
		ВыбранныйЭлемент = ВыбратьИзСписка(ВидыПДР, Элемент,); 
		
		Если ВыбранныйЭлемент <> Неопределено Тогда
			УстановитьВидОпераций(ВыбранныйЭлемент.Значение);
		КонецЕсли;
		ВидимостьЭлементовПоВидуОперации();//Паганини
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокВидыОпераций()
	ВидыПДР = Новый СписокЗначений;
	Если  Объект.СсылкаИсточника = "ПоступлениеНаСчет"  Тогда
		
		ВидыПДР.Добавить(Перечисления.ВидыОперацийПоступлениеНаСчет.ОтПокупателя);
		ВидыПДР.Добавить(Перечисления.ВидыОперацийПоступлениеНаСчет.ОтПоставщика);
		ВидыПДР.Добавить(Перечисления.ВидыОперацийПоступлениеНаСчет.ОтПодотчетника);
		ВидыПДР.Добавить(Перечисления.ВидыОперацийПоступлениеНаСчет.Прочее);
		ВидыПДР.Добавить(Перечисления.ВидыОперацийПоступлениеНаСчет.Налоги);
		ВидыПДР.Добавить(Перечисления.ВидыОперацийПоступлениеНаСчет.ПоступлениеОплатыПоКартам);//Паганини
		
	ИначеЕсли Объект.СсылкаИсточника = "РасходСоСчета" Тогда
		
		ВидыПДР.Добавить(Перечисления.ВидыОперацийРасходСоСчета.Поставщику);
		ВидыПДР.Добавить(Перечисления.ВидыОперацийРасходСоСчета.Покупателю);
		ВидыПДР.Добавить(Перечисления.ВидыОперацийРасходСоСчета.Подотчетнику);
		ВидыПДР.Добавить(Перечисления.ВидыОперацийРасходСоСчета.Прочее);
		ВидыПДР.Добавить(Перечисления.ВидыОперацийРасходСоСчета.Налоги);
		
		
	КонецЕсли;
	
	Возврат ВидыПДР;
КонецФункции // ()

&НаСервере
Процедура УстановитьВидОпераций(ЗнчВидОпераций)

	 Объект.ВидОперации = ЗнчВидОпераций;

КонецПроцедуры // ()
